//*****************************************************
//
// 地面の処理[field.cpp]
// Author:髙山桃也
//
//*****************************************************

//*****************************************************
// インクルード
//*****************************************************
#include "field.h"
#include "manager.h"
#include "texture.h"

//=====================================================
// コンストラクタ
//=====================================================
CField::CField()
{
	m_pField = nullptr;
	ZeroMemory(&m_apPolygon[0],sizeof(m_apPolygon));
}

//=====================================================
// デストラクタ
//=====================================================
CField::~CField()
{

}

//=====================================================
// 初期化処理
//=====================================================
HRESULT CField::Init(void)
{
	return S_OK;
}

//=====================================================
// 終了処理
//=====================================================
void CField::Uninit(void)
{

}

//=====================================================
// 更新処理
//=====================================================
void CField::Update(void)
{

}

//=====================================================
// 描画処理
//=====================================================
void CField::Draw(void)
{

}

//=====================================================
// 生成処理
//=====================================================
CField *CField::Create(D3DXVECTOR3 pos,float width,float height)
{
	CField *pField = nullptr;

	if (pField == nullptr)
	{
		pField = new CField;

		if (pField != nullptr)
		{
			pField->SetPosition(pos);

			// 初期化処理
			pField->Init();

			// テクスチャの読込
			int nIdx = CTexture::GetInstance()->Regist("data\\TEXTURE\\BG\\metal000.jpg");
			//pField->SetIdxTexture(nIdx);
		}
	}

	return pField;
}