//*****************************************************
//
// 入力処理[input.cpp]
// Author:髙山桃也
//
//*****************************************************

//*****************************************************
// インクルード
//*****************************************************
#include "input.h"

//*****************************************************
// 静的メンバ変数宣言
//*****************************************************
LPDIRECTINPUT8 CInput::m_pInput = nullptr;	// DirectInputオブジェクトへのポインタ

//=====================================================
// コンストラクタ
//=====================================================
CInput::CInput()
{
	m_pDevice = nullptr;
}

//=====================================================
// デストラクタ
//=====================================================
CInput::~CInput()
{

}

//=====================================================
// 初期化処理
//=====================================================
HRESULT CInput::Init(HINSTANCE hInstance, HWND hWnd)
{
	if (m_pInput == nullptr)
	{
		//DirectInputオブジェクトの生成
		if (FAILED(DirectInput8Create(hInstance, DIRECTINPUT_VERSION, IID_IDirectInput8, (void**)&m_pInput, nullptr)))
		{
			return E_FAIL;
		}
	}

	return S_OK;
}

//=====================================================
// 終了処理
//=====================================================
void CInput::Uninit(void)
{
	if (m_pDevice != nullptr)
	{//入力デバイス破棄
		m_pDevice->Unacquire();
		m_pDevice->Release();
		m_pDevice = nullptr;
	}

	if (m_pInput != nullptr)
	{//DirectInputオブジェクトの破棄
		m_pInput->Release();
		m_pInput = nullptr;
	}
}