//*****************************************************
//
// オブジェクト管理[objectmanager.cpp]
// Author:髙山桃也
//
//*****************************************************

//*****************************************************
// インクルード
//*****************************************************
#include "objectmanager.h"

//=====================================================
// コンストラクタ
//=====================================================
CObjectManager::CObjectManager()
{
	m_pPlayer = nullptr;
	m_pTutorialPlayer = nullptr;
	m_pMeshField = nullptr;
	m_pScore = nullptr;
	m_pTimer = nullptr;
}

//=====================================================
// デストラクタ
//=====================================================
CObjectManager::~CObjectManager()
{

}

//=====================================================
// プレイヤー破棄処理
//=====================================================
void CObjectManager::ReleasePlayer(void)
{
	if (m_pPlayer != nullptr)
	{
		m_pPlayer = nullptr;
	}
}

//=====================================================
// スコア終了処理
//=====================================================
void CObjectManager::ReleaseScore(void)
{
	if (m_pScore != nullptr)
	{// スコアの終了・破棄
		m_pScore = nullptr;
	}
}

//=====================================================
// タイマー終了処理
//=====================================================
void CObjectManager::ReleaseTimer(void)
{
	if (m_pTimer != nullptr)
	{// スコアの終了・破棄
		m_pTimer = nullptr;
	}
}